debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/console/apac-smoke.log
[k6] K6 version: k6 v0.53.0 (commit/f82a27da8f, go1.22.6, linux/amd64)
[k6] Pre-flight: checking https://34.8.134.246.nip.io/nginx-health ...
[k6] Results will be written to: json=debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/apac-smoke.json

╔══════════════════════════════════════════════════╗
║         VCS K6 LOAD TEST RUNNER                ║
╚══════════════════════════════════════════════════╝

[k6] Scenario  : SMOKE
[k6] Target    : https://34.8.134.246.nip.io
[k6] Results   : /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T113332.json

[k6] Running: k6 run --out json=debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/apac-smoke.json --summary-export /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T113332.json --env K6_SCENARIO=smoke --env BASE_URL=https://34.8.134.246.nip.io /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js


          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js
        output: json (debug-artifacts/load-tests/20260410T102719Z-fixed-full-suite/metrics/apac-smoke.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 1 looping VUs for 30s (gracefulStop: 30s)

time="2026-04-10T11:33:32Z" level=info msg="\n============================================================" source=console
time="2026-04-10T11:33:32Z" level=info msg="VCS Load Test — Scenario: SMOKE" source=console
time="2026-04-10T11:33:32Z" level=info msg="Base URL: https://34.8.134.246.nip.io" source=console
time="2026-04-10T11:33:32Z" level=info msg="============================================================\n" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   2% ] 1 VUs  00.7s/30s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   6% ] 1 VUs  01.7s/30s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   9% ] 1 VUs  02.7s/30s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  12% ] 1 VUs  03.7s/30s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  16% ] 1 VUs  04.7s/30s

running (0m06.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  19% ] 1 VUs  05.7s/30s

running (0m07.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  22% ] 1 VUs  06.7s/30s

running (0m08.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  26% ] 1 VUs  07.7s/30s

running (0m09.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  29% ] 1 VUs  08.7s/30s

running (0m10.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  32% ] 1 VUs  09.7s/30s

running (0m11.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  36% ] 1 VUs  10.7s/30s

running (0m12.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  39% ] 1 VUs  11.7s/30s

running (0m13.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  42% ] 1 VUs  12.7s/30s

running (0m14.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  46% ] 1 VUs  13.7s/30s

running (0m15.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  49% ] 1 VUs  14.7s/30s

running (0m16.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  52% ] 1 VUs  15.7s/30s

running (0m17.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  56% ] 1 VUs  16.7s/30s

running (0m18.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  59% ] 1 VUs  17.7s/30s

running (0m19.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  62% ] 1 VUs  18.7s/30s

running (0m20.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  66% ] 1 VUs  19.7s/30s

running (0m21.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  69% ] 1 VUs  20.7s/30s

running (0m22.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  72% ] 1 VUs  21.7s/30s

running (0m23.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  76% ] 1 VUs  22.7s/30s

running (0m24.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  79% ] 1 VUs  23.7s/30s

running (0m25.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  82% ] 1 VUs  24.7s/30s

running (0m26.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  86% ] 1 VUs  25.7s/30s

running (0m27.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  89% ] 1 VUs  26.7s/30s

running (0m28.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  92% ] 1 VUs  27.7s/30s

running (0m29.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  96% ] 1 VUs  28.7s/30s

running (0m30.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke   [  99% ] 1 VUs  29.7s/30s

running (0m31.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m32.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m33.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m34.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m35.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m36.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m37.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m38.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m39.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m40.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m41.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s
time="2026-04-10T11:34:14Z" level=info msg="\n============================================================" source=console
time="2026-04-10T11:34:14Z" level=info msg="Test complete — Scenario: smoke" source=console
time="2026-04-10T11:34:14Z" level=info msg="Target: https://34.8.134.246.nip.io" source=console
time="2026-04-10T11:34:14Z" level=info msg="Circuit breaker trips detected: check circuit_breaker_trips metric" source=console
time="2026-04-10T11:34:14Z" level=info msg="============================================================\n" source=console

     █ auth: register

       ✓ register: status 201 or 409

     █ auth: get profile

       ✓ profile: status 200
       ✓ profile: has email

     █ capacity: check availability

       ✓ segments: status 200
       ✓ segments: is array

     █ capacity: occupancy

       ✓ occupancy: status 200

     █ notifications: list

       ✓ notifications: status 200

     █ notifications: mark all read

       ✓ mark-read: status 200 or 204

     █ map: search places

       ✓ search: status 200 or 429

     █ map: get route

       ✓ route: status 200

     █ journey: create

       ✗ journey create: status 201/200/409/422
        ↳  0% — ✓ 0 / ✗ 1
       ✗ journey create: not 5xx (except 503)
        ↳  0% — ✓ 0 / ✗ 1

   ✓ auth_success...................: 100.00% ✓ 3        ✗ 0  
   ✗ capacity_check_duration........: avg=944ms    min=838ms    med=944ms    max=1.05s    p(90)=1.02s    p(95)=1.03s   
     checks.........................: 90.47%  ✓ 19       ✗ 2  
     data_received..................: 193 kB  4.7 kB/s
     data_sent......................: 6.7 kB  163 B/s
     group_duration.................: avg=2.13s    min=539.98ms med=1.2s     max=11.23s   p(90)=4.36s    p(95)=7.51s   
     http_req_blocked...............: avg=807.78µs min=385ns    med=807ns    max=7.06ms   p(90)=2.92ms   p(95)=6.15ms  
     http_req_connecting............: avg=75.9µs   min=0s       med=0s       max=634.68µs p(90)=289.86µs p(95)=593.47µs
   ✗ http_req_duration..............: avg=2.01s    min=264.29ms med=1.12s    max=11.23s   p(90)=3.97s    p(95)=7.25s   
       { expected_response:true }...: avg=1.4s     min=264.29ms med=1.05s    max=5.92s    p(90)=1.93s    p(95)=3.19s   
   ✗ http_req_failed................: 6.25%   ✓ 1        ✗ 15 
     http_req_receiving.............: avg=49.1ms   min=119.46µs med=163.07µs max=268.19ms p(90)=191.32ms p(95)=258.1ms 
     http_req_sending...............: avg=118.13µs min=84.3µs   med=107.19µs max=205.69µs p(90)=154.46µs p(95)=170.37µs
     http_req_tls_handshaking.......: avg=646.11µs min=0s       med=0s       max=5.25ms   p(90)=2.54ms   p(95)=5.12ms  
     http_req_waiting...............: avg=1.96s    min=263.92ms med=1.06s    max=11.23s   p(90)=3.96s    p(95)=7.24s   
     http_reqs......................: 16      0.387696/s
     iteration_duration.............: avg=8.25s    min=166.87µs med=4.79s    max=29.63s   p(90)=20.4s    p(95)=25.02s  
     iterations.....................: 3       0.072693/s
     journey_create_errors..........: 1       0.024231/s
   ✗ journey_create_success.........: 0.00%   ✓ 0        ✗ 1  
   ✗ route_compute_duration.........: avg=5.92s    min=5.92s    med=5.92s    max=5.92s    p(90)=5.92s    p(95)=5.92s   
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0m41.3s), 0/1 VUs, 3 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  30s
time="2026-04-10T11:34:14Z" level=error msg="thresholds on metrics 'capacity_check_duration, http_req_duration, http_req_failed, journey_create_success, route_compute_duration' have been crossed"